"""
This file contains the public configuration for the project.
"""
"""
每个环上的原子序号
"""
RING_ATOM_ID_LIST = [
    [37, 38, 44, 45, 46, 47],  # ring_1
    [29, 39, 38, 37, 36],  # ring_2
    [17, 16, 24, 23, 22],
    [10, 11, 16, 17, 18],
    [1, 2, 12, 11, 10],
    [5, 4, 3, 2, 1, 6],
    [8, 9, 5, 6, 7],
    [4, 13, 14, 15, 3],
    [21, 20, 19, 14, 13],
    [25, 26, 27, 19, 20],
    [31, 40, 41, 42, 43],
    [41, 51, 50, 49, 48, 42],
]

"""
按照分子对称性选取参与聚类的环的序号
"""

RING_ID_FOR_CLUSTER  =  [0, 1, 2, 3, 4, 5, 6]
RING_ID_FOR_CLUSTER_T = [11, 10, 9, 8, 7, 6, 5]
